alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4500.svd
				<register>
					<name>BUSWCON0</name>
					<description>EBU Bus Write Configuration Register</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<resetValue>0x00D30000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FETBLEN</name>
							<description>Burst Length for Synchronous Burst</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 data access (default after reset).</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 data accesses.</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>4 data accesses.</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>8 data accesses.</description>
									<value>#011</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FBBMSEL</name>
							<description>Synchronous burst buffer mode select</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Burst buffer length defined by value in FETBLEN (default after reset).</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Continuous mode. All data required for transaction transferred in single burst</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NAA</name>
							<description>Enable flash non-array access workaround</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ECSE</name>
							<description>Early Chip Select for Synchronous Burst</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CS is delayed.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CS is not delayed.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EBSE</name>
							<description>Early Burst Signal Enable for Synchronous Burst</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>ADV is delayed.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>ADV is not delayed.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAITINV</name>
							<description>Reversed polarity at WAIT</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>input at WAIT pin is active low (default after reset).</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>input at WAIT pin is active high.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BCGEN</name>
							<description>Byte Control Signal Control</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Byte control signals follow chip select timing.</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Byte control signals follow control signal timing (RD, RD/WR) (default after reset).</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Byte control signals follow write enable signal timing (RD/WR only).</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PORTW</name>
							<description>Device Addressing Mode</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>WAIT</name>
							<description>External Wait Control: 0=OFF (default after reset)., 1=Asynchronous input at WAIT., 2=Synchronous input at WAIT., 3=reserved., 0=OFF (default after reset)., 1=Wait for page load (Early WAIT)., 2=Wait for page load (WAIT with data)., 3=Abort and retry access., </description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AAP</name>
							<description>Asynchronous Address phase:</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Clock is enabled at beginning of access.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Clock is enabled at after address phase.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOCKCS</name>
							<description>Lock Chip Select</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Chip Select cannot be locked (default after reset).</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Chip Select will be automatically locked when written to from the processor data port.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AGEN</name>
							<description>Device Type for Region</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUSWAP0</name>
					<description>EBU Bus Write Access Parameter Register</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<resetValue>0xFFFFFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WRDTACS</name>
							<description>Recovery Cycles between Different Regions</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Recovery Phase clock cycles available.</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>1 clock cycle selected.</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>14 clock cycles selected.</description>
									<value>#1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>15 clock cycles selected.</description>
									<value>#1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WRRECOVC</name>
							<description>Recovery Cycles after Write Accesses</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Recovery Phase clock cycles available.</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>1 clock cycle selected.</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>6 clock cycles selected.</description>
									<value>#110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>7 clock cycles selected.</description>
									<value>#111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAITWRC</name>
							<description>Programmed Wait States for write accesses</description>
							<lsb>7</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 wait state.</description>
									<value>#00000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>1 wait states.</description>
									<value>#00001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>2 wait state.</description>
									<value>#00010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>30 wait states.</description>
									<value>#11110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>31 wait states.</description>
									<value>#11111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DATAC</name>
							<description>Data Hold Cycles for Write Accesses</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Recovery Phase clock cycles available.</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>1 clock cycle selected.</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>14 clock cycles selected.</description>
									<value>#1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>15 clock cycles selected.</description>
									<value>#1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTCLOCK</name>
							<description>Frequency of external clock at pin BFCLKO</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Equal to INT_CLK frequency.</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>1/2 of INT_CLK frequency.</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>1/3 of INT_CLK frequency.</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>1/4 of INT_CLK frequency (default after reset).</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTDATA</name>
							<description>Extended data</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>external memory outputs data every BFCLK cycle</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>external memory outputs data every two BFCLK cycles</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>external memory outputs data every four BFCLK cycles</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>external memory outputs data every eight BFCLK cycles</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMDDELAY</name>
							<description>Command Delay Cycles</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>0 clock cycle selected.</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>1 clock cycle selected.</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>14 clock cycles selected.</description>
									<value>#1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>15 clock cycles selected.</description>
									<value>#1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AHOLDC</name>
							<description>Address Hold Cycles</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>0 clock cycle selected</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>1 clock cycle selected</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>14 clock cycles selected</description>
									<value>#1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>15 clock cycles selected</description>
									<value>#1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADDRC</name>
							<description>Address Cycles</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 clock cycle selected</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>1 clock cycle selected</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>14 clock cycles selected</description>
									<value>#1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>15 clock cycles selected</description>
									<value>#1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
