alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4500.svd
				<register>
					<name>OPERATION_MODE</name>
					<description>Operation Mode Register</description>
					<addressOffset>0x1018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SR</name>
							<description>Start or Stop Receive</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OSF</name>
							<description>Operate on Second Frame</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RTC</name>
							<description>Receive Threshold Control</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FUF</name>
							<description>Forward Undersized Good Frames</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FEF</name>
							<description>Forward Error Frames</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ST</name>
							<description>Start or Stop Transmission Command</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TTC</name>
							<description>Transmit Threshold Control</description>
							<lsb>14</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FTF</name>
							<description>Flush Transmit FIFO</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSF</name>
							<description>Transmit Store and Forward</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DFF</name>
							<description>Disable Flushing of Received Frames</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSF</name>
							<description>Receive Store and Forward</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DT</name>
							<description>Disable Dropping of TCP/IP Checksum Error Frames</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>INTERRUPT_ENABLE</name>
					<description>Interrupt Enable Register</description>
					<addressOffset>0x101C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TIE</name>
							<description>Transmit Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TSE</name>
							<description>Transmit Stopped Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TUE</name>
							<description>Transmit Buffer Unvailable Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TJE</name>
							<description>Transmit Jabber Timeout Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OVE</name>
							<description>Overflow Interrupt Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>UNE</name>
							<description>Underflow Interrupt Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RIE</name>
							<description>Receive Interrupt Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RUE</name>
							<description>Receive Buffer Unavailable Enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RSE</name>
							<description>Receive Stopped Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RWE</name>
							<description>Receive Watchdog Timeout Enable</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ETE</name>
							<description>Early Transmit Interrupt Enable</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FBE</name>
							<description>Fatal Bus Error Enable</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ERE</name>
							<description>Early Receive Interrupt Enable</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AIE</name>
							<description>Abnormal Interrupt Summary Enable</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NIE</name>
							<description>Normal Interrupt Summary Enable</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER</name>
					<description>Missed Frame and Buffer Overflow Counter Register</description>
					<addressOffset>0x1020</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MISFRMCNT</name>
							<description>This field indicates the number of frames missed by the controller because of the RAM Receive Buffer being unavailable. This counter is incremented each time the DMA discards an incoming frame. The counter is cleared when this register is read.</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MISCNTOVF</name>
							<description>Overflow bit for Missed Frame Counter</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVFFRMCNT</name>
							<description>This field indicates the number of frames missed by the application. The counter is cleared when this register is read.</description>
							<lsb>17</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OVFCNTOVF</name>
							<description>Overflow bit for FIFO Overflow Counter</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RECEIVE_INTERRUPT_WATCHDOG_TIMER</name>
					<description>Receive Interrupt Watchdog Timer Register</description>
					<addressOffset>0x1024</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RIWT</name>
							<description>RI Watchdog Timer Count</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AHB_STATUS</name>
					<description>AHB Status Register</description>
					<addressOffset>0x102C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>AHBMS</name>
							<description>AHB Master Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CURRENT_HOST_TRANSMIT_DESCRIPTOR</name>
					<description>Current Host Transmit Descriptor Register</description>
					<addressOffset>0x1048</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CURTDESAPTR</name>
							<description>Host Transmit Descriptor Address Pointer</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CURRENT_HOST_RECEIVE_DESCRIPTOR</name>
					<description>Current Host Receive Descriptor Register</description>
					<addressOffset>0x104C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CURRDESAPTR</name>
							<description>Host Receive Descriptor Address Pointer</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS</name>
					<description>Current Host Transmit Buffer Address Register</description>
					<addressOffset>0x1050</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CURTBUFAPTR</name>
							<description>Host Transmit Buffer Address Pointer</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CURRENT_HOST_RECEIVE_BUFFER_ADDRESS</name>
					<description>Current Host Receive Buffer Address Register</description>
					<addressOffset>0x1054</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CURRBUFAPTR</name>
							<description>Host Receive Buffer Address Pointer</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HW_FEATURE</name>
					<description>HW Feature Register</description>
					<addressOffset>0x1058</addressOffset>
					<size>32</size>
					<resetValue>0x03052F35</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MIISEL</name>
							<description>10 or 100 Mbps support</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>GMIISEL</name>
							<description>1000 Mbps support</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HDSEL</name>
							<description>Half-Duplex support</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EXTHASHEN</name>
							<description>Expanded DA Hash Filter</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HASHSEL</name>
							<description>HASH Filter</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDMACADRSEL</name>
							<description>Multiple MAC Address Registers</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PCSSEL</name>
							<description>PCS registers (TBI, SGMII, or RTBI PHY interface)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>L3L4FLTREN</name>
							<description>Layer 3 and Layer 4 Filter Feature</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SMASEL</name>
							<description>SMA (MDIO) Interface</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RWKSEL</name>
							<description>PMT Remote Wakeup</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MGKSEL</name>
							<description>PMT Magic Packet</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MMCSEL</name>
							<description>RMON Module</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSVER1SEL</name>
							<description>Only IEEE 1588-2002 Timestamp</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TSVER2SEL</name>
							<description>IEEE 1588-2008 Advanced Timestamp</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EEESEL</name>
							<description>Energy Efficient Ethernet</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AVSEL</name>
							<description>AV Feature</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXCOESEL</name>
							<description>Checksum Offload in Tx</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXTYP1COE</name>
							<description>IP Checksum Offload (Type 1) in Rx</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXTYP2COE</name>
							<description>IP Checksum Offload (Type 2) in Rx</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXFIFOSIZE</name>
							<description>Rx FIFO &gt; 2,048 Bytes</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXCHCNT</name>
							<description>Number of additional Rx channels</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXCHCNT</name>
							<description>Number of additional Tx channels</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ENHDESSEL</name>
							<description>Alternate (Enhanced Descriptor)</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>INTTSEN</name>
							<description>Timestamping with Internal System Time</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FLEXIPPSEN</name>
							<description>Flexible Pulse-Per-Second Output</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SAVLANINS</name>
							<description>Source Address or VLAN Insertion</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ACTPHYIF</name>
							<description>Active or Selected PHY interface</description>
							<lsb>28</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
