alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4500.svd
				<register>
					<name>PCR</name>
					<description>Protocol Control Register</description>
					<addressOffset>0x03C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CTR0</name>
							<description>Protocol Control Bit 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR1</name>
							<description>Protocol Control Bit 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR2</name>
							<description>Protocol Control Bit 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR3</name>
							<description>Protocol Control Bit 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR4</name>
							<description>Protocol Control Bit 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR5</name>
							<description>Protocol Control Bit 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR6</name>
							<description>Protocol Control Bit 6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR7</name>
							<description>Protocol Control Bit 7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR8</name>
							<description>Protocol Control Bit 8</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR9</name>
							<description>Protocol Control Bit 9</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR10</name>
							<description>Protocol Control Bit 10</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR11</name>
							<description>Protocol Control Bit 11</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR12</name>
							<description>Protocol Control Bit 12</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR13</name>
							<description>Protocol Control Bit 13</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR14</name>
							<description>Protocol Control Bit 14</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR15</name>
							<description>Protocol Control Bit 15</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR16</name>
							<description>Protocol Control Bit 16</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR17</name>
							<description>Protocol Control Bit 17</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR18</name>
							<description>Protocol Control Bit 18</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR19</name>
							<description>Protocol Control Bit 19</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR20</name>
							<description>Protocol Control Bit 20</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR21</name>
							<description>Protocol Control Bit 21</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR22</name>
							<description>Protocol Control Bit 22</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR23</name>
							<description>Protocol Control Bit 23</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR24</name>
							<description>Protocol Control Bit 24</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR25</name>
							<description>Protocol Control Bit 25</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR26</name>
							<description>Protocol Control Bit 26</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR27</name>
							<description>Protocol Control Bit 27</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR28</name>
							<description>Protocol Control Bit 28</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR29</name>
							<description>Protocol Control Bit 29</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR30</name>
							<description>Protocol Control Bit 30</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CTR31</name>
							<description>Protocol Control Bit 31</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PCR_ASCMode</name>
					<description>Protocol Control Register [ASC Mode]</description>
					<alternateRegister>PCR</alternateRegister>
					<addressOffset>0x03C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SMD</name>
							<description>Sample Mode</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Only one sample is taken per bit time. The current input value is sampled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Three samples are taken per bit time and a majority decision is made.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STPB</name>
							<description>Stop Bits</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The number of stop bits is 1.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The number of stop bits is 2.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDM</name>
							<description>Idle Detection Mode</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The bus idle detection is switched off and bits PSR.TXIDLE and PSR.RXIDLE are set automatically to enable data transfers without checking the inputs before.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The bus is considered as idle after a number of consecutive passive bit times defined by SCTR.FLE plus 2 (in the case without parity bit) or plus 3 (in the case with parity bit).</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SBIEN</name>
							<description>Synchronization Break Interrupt Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The interrupt generation is disabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The interrupt generation is enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CDEN</name>
							<description>Collision Detection Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The collision detection is disabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>If a collision is detected, the transmitter stops its data transmission, outputs a 1, sets bit PSR.COL and generates a protocol interrupt. In order to allow data transmission again, PSR.COL has to be cleared by software.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RNIEN</name>
							<description>Receiver Noise Detection Interrupt Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The interrupt generation is disabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The interrupt generation is enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FEIEN</name>
							<description>Format Error Interrupt Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The interrupt generation is disabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The interrupt generation is enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FFIEN</name>
							<description>Frame Finished Interrupt Enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The interrupt generation is disabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The interrupt generation is enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SP</name>
							<description>Sample Point</description>
							<lsb>8</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PL</name>
							<description>Pulse Length</description>
							<lsb>13</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The pulse length is equal to the bit length (no shortened 0).</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The pulse length of a 0 bit is 2 time quanta.</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>The pulse length of a 0 bit is 3 time quanta.</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>The pulse length of a 0 bit is 8 time quanta.</description>
									<value>#111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RSTEN</name>
							<description>Receiver Status Enable</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Flag PSR[9] is not modified depending on the receiver status.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Flag PSR[9] is set during the complete reception of a frame.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TSTEN</name>
							<description>Transmitter Status Enable</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Flag PSR[9] is not modified depending on the transmitter status.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Flag PSR[9] is set during the complete transmission of a frame.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCLK</name>
							<description>Master Clock Enable</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The MCLK generation is disabled and the MCLK signal is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The MCLK generation is enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PCR_SSCMode</name>
					<description>Protocol Control Register [SSC Mode]</description>
					<alternateRegister>PCR</alternateRegister>
					<addressOffset>0x03C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MSLSEN</name>
							<description>MSLS Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The MSLS generation is disabled (MSLS = 0). This is the setting for SSC slave mode.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The MSLS generation is enabled. This is the setting for SSC master mode.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SELCTR</name>
							<description>Select Control</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The coded select mode is enabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The direct select mode is enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SELINV</name>
							<description>Select Inversion</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The SELO outputs have the same polarity as the MSLS signal (active high).</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The SELO outputs have the inverted polarity to the MSLS signal (active low).</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FEM</name>
							<description>Frame End Mode</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The current data frame is considered as finished when the last bit of a data word has been sent out and the transmit buffer TBUF does not contain new data (TDV = 0).</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The MSLS signal is kept active also while no new data is available and no other end of frame condition is reached. In this case, the software can accept delays in delivering the data without automatic deactivation of MSLS in multi-word data frames.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CTQSEL1</name>
							<description>Input Frequency Selection</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>fCTQIN = fPDIV</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>fCTQIN = fPPP</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>fCTQIN = fSCLK</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>fCTQIN = fMCLK</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCTQ1</name>
							<description>Divider Factor PCTQ1 for Tiw and Tnf</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCTQ1</name>
							<description>Divider Factor DCTQ1 for Tiw and Tnf</description>
							<lsb>8</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PARIEN</name>
							<description>Parity Error Interrupt Enable</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>A protocol interrupt is not generated with the detection of a parity error.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A protocol interrupt is generated with the detection of a parity error.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSLSIEN</name>
							<description>MSLS Interrupt Enable</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>A protocol interrupt is not generated if a change of signal MSLS is detected.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A protocol interrupt is generated if a change of signal MSLS is detected.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DX2TIEN</name>
							<description>DX2T Interrupt Enable</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>A protocol interrupt is not generated if DX2T is activated.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A protocol interrupt is generated if DX2T is activated.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SELO</name>
							<description>Select Output</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The corresponding SELOx line cannot be activated.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The corresponding SELOx line can be activated (according to the mode selected by SELCTR).</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIWEN</name>
							<description>Enable Inter-Word Delay Tiw</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No delay between data words of the same frame.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The inter-word delay Tiw is enabled and introduced between data words of the same frame.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCLK</name>
							<description>Master Clock Enable</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The MCLK generation is disabled and output MCLK = 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The MCLK generation is enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
