alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4500.svd
				<register>
					<name>TBCTR</name>
					<description>Transmitter Buffer Control Register</description>
					<addressOffset>0x108</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DPTR</name>
							<description>Data Pointer</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LIMIT</name>
							<description>Limit For Interrupt Generation</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STBTM</name>
							<description>Standard Transmit Buffer Trigger Mode</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Trigger mode 0: While TRBSR.STBT=1, a standard buffer event will be generated whenever there is a data transfer to TBUF or data write to INx (depending on TBCTR.LOF setting). STBT is cleared when TRBSR.TBFLVL=TBCTR.LIMIT.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Trigger mode 1: While TRBSR.STBT=1, a standard buffer event will be generated whenever there is a data transfer to TBUF or data write to INx (depending on TBCTR.LOF setting). STBT is cleared when TRBSR.TBFLVL=TBCTR.SIZE.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STBTEN</name>
							<description>Standard Transmit Buffer Trigger Enable</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The standard transmit buffer event trigger through bit TRBSR.STBT is disabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The standard transmit buffer event trigger through bit TRBSR.STBT is enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STBINP</name>
							<description>Standard Transmit Buffer Interrupt Node Pointer</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Output SR0 becomes activated.</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Output SR1 becomes activated.</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Output SR2 becomes activated.</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Output SR3 becomes activated.</description>
									<value>#011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Output SR4 becomes activated.</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Output SR5 becomes activated.</description>
									<value>#101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ATBINP</name>
							<description>Alternative Transmit Buffer Interrupt Node Pointer</description>
							<lsb>19</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Output SR0 becomes activated.</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Output SR1 becomes activated.</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Output SR2 becomes activated.</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Output SR3 becomes activated.</description>
									<value>#011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Output SR4 becomes activated.</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Output SR5 becomes activated.</description>
									<value>#101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SIZE</name>
							<description>Buffer Size</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The FIFO mechanism is disabled. The buffer does not accept any request for data.</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The FIFO buffer contains 2 entries.</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>The FIFO buffer contains 4 entries.</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>The FIFO buffer contains 8 entries.</description>
									<value>#011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>The FIFO buffer contains 16 entries.</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>The FIFO buffer contains 32 entries.</description>
									<value>#101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>The FIFO buffer contains 64 entries.</description>
									<value>#110</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOF</name>
							<description>Buffer Event on Limit Overflow</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>A standard transmit buffer event occurs when the filling level equals the limit value and gets lower due to transmission of a data word.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A standard transmit buffer interrupt event occurs when the filling level equals the limit value and gets bigger due to a write access to a data input location INx.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STBIEN</name>
							<description>Standard Transmit Buffer Interrupt Enable</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The standard transmit buffer interrupt generation is disabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The standard transmit buffer interrupt generation is enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TBERIEN</name>
							<description>Transmit Buffer Error Interrupt Enable</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The transmit buffer error interrupt generation is disabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The transmit buffer error interrupt generation is enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>RBCTR</name>
					<description>Receiver Buffer Control Register</description>
					<addressOffset>0x10C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DPTR</name>
							<description>Data Pointer</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LIMIT</name>
							<description>Limit For Interrupt Generation</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SRBTM</name>
							<description>Standard Receive Buffer Trigger Mode</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Trigger mode 0: While TRBSR.SRBT=1, a standard receive buffer event will be generated whenever there is a new data received or data read out (depending on RBCTR.LOF setting). SRBT is cleared when TRBSR.RBFLVL=RBCTR.LIMIT.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Trigger mode 1: While TRBSR.SRBT=1, a standard receive buffer event will be generated whenever there is a new data received or data read out (depending on RBCTR.LOF setting). SRBT is cleared when TRBSR.RBFLVL=0.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRBTEN</name>
							<description>Standard Receive Buffer Trigger Enable</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The standard receive buffer event trigger through bit TRBSR.SRBT is disabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The standard receive buffer event trigger through bit TRBSR.SRBT is enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRBINP</name>
							<description>Standard Receive Buffer Interrupt Node Pointer</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Output SR0 becomes activated.</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Output SR1 becomes activated.</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Output SR2 becomes activated.</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Output SR3 becomes activated.</description>
									<value>#011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Output SR4 becomes activated.</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Output SR5 becomes activated.</description>
									<value>#101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ARBINP</name>
							<description>Alternative Receive Buffer Interrupt Node Pointer</description>
							<lsb>19</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Output SR0 becomes activated.</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Output SR1 becomes activated.</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Output SR2 becomes activated.</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Output SR3 becomes activated.</description>
									<value>#011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Output SR4 becomes activated.</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Output SR5 becomes activated.</description>
									<value>#101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RCIM</name>
							<description>Receiver Control Information Mode</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>RCI[4] = PERR, RCI[3:0] = WLEN</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>RCI[4] = SOF, RCI[3:0] = WLEN</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>RCI[4] = 0, RCI[3:0] = WLEN</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>RCI[4] = PERR, RCI[3] = PAR, RCI[2:1] = 00B, RCI[0] = SOF</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SIZE</name>
							<description>Buffer Size</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The FIFO mechanism is disabled. The buffer does not accept any request for data.</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The FIFO buffer contains 2 entries.</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>The FIFO buffer contains 4 entries.</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>The FIFO buffer contains 8 entries.</description>
									<value>#011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>The FIFO buffer contains 16 entries.</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>The FIFO buffer contains 32 entries.</description>
									<value>#101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>The FIFO buffer contains 64 entries.</description>
									<value>#110</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RNM</name>
							<description>Receiver Notification Mode</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Filling level mode: A standard receive buffer event occurs when the filling level equals the limit value and changes, either due to a read access from OUTR (LOF = 0) or due to a new received data word (LOF = 1).</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>RCI mode: A standard receive buffer event occurs when register OUTR is updated with a new value if the corresponding value in OUTR.RCI[4] = 0. If OUTR.RCI[4] = 1, an alternative receive buffer event occurs instead of the standard receive buffer event.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOF</name>
							<description>Buffer Event on Limit Overflow</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>A standard receive buffer event occurs when the filling level equals the limit value and gets lower due to a read access from OUTR.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A standard receive buffer event occurs when the filling level equals the limit value and gets bigger due to the reception of a new data word.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ARBIEN</name>
							<description>Alternative Receive Buffer Interrupt Enable</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The alternative receive buffer interrupt generation is disabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The alternative receive buffer interrupt generation is enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRBIEN</name>
							<description>Standard Receive Buffer Interrupt Enable</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The standard receive buffer interrupt generation is disabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The standard receive buffer interrupt generation is enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RBERIEN</name>
							<description>Receive Buffer Error Interrupt Enable</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The receive buffer error interrupt generation is disabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The receive buffer error interrupt generation is enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TRBPTR</name>
					<description>Transmit/Receive Buffer Pointer Register</description>
					<addressOffset>0x110</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TDIPTR</name>
							<description>Transmitter Data Input Pointer</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TDOPTR</name>
							<description>Transmitter Data Output Pointer</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RDIPTR</name>
							<description>Receiver Data Input Pointer</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RDOPTR</name>
							<description>Receiver Data Output Pointer</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
